---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyWallPanels
source: html/97e56b0f-f8a4-07f4-191e-69328d80bf95.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyWallPanels Property

Cannot copy wall panels unless their parent wall is also being copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyWallPanels { get; }
```